Repository: mahmoodawd/flutter_hijri_reminder
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Home
ar: الرئيسية

# remainingDays
source: {remainingDays, select, gone{Gone}, yesterday{Yesterday}, today{Today}, tommorow{Tommorow}, other{In {remainingDays} days}}
ar: {remainingDays, select, gone{انتهى}, yesterday{بالأمس}, today{اليوم}, tommorow{غدا}, other{بعد {remainingDays} يوم}}

# publicIslamicEvents
source: {publicIslamicEvents, select, Year_start{Year start}, Prophit_birth{Prophit birth}, Esraa_Me3raj{Esraa & Me3raj}, 1st_Of_Ramadan{1st Of Ramadan}, Qadr{Qadr}, Fitr_eid{Fitr eid}, 3arafa{3arafa}, Adha_eid{Adha eid}, other{other}}
ar: {publicIslamicEvents, select, Year_start{رأس السنة}, Prophit_birth{المولد النبوي}, Esraa_Me3raj{الإسراء والمعراج}, 1st_Of_Ramadan{غرة رمضان}, Qadr{ليلة القدر}, Fitr_eid{عيد الفطر}, 3arafa{وقفة عرفة}, Adha_eid{عيد الأضحى}, other{أخرى}}

# notificationBody
source: Today is :
ar: اليوم هو :

# forYear
source: for
ar: لعام

source: Preferences
ar: التفضيلات

# appDescription
source: Reminder app in Hijri
ar: تطبيق تذكير بالهجري

# contact
source: You can reach us at:
ar: يمكنك التواصل معنا عبر:

# fontSample
source: Font will be like this
ar: سيتم عرض التطبيق بهذا الخط

source: Create Event
ar: إنشاء جديد

source: Settings
ar: الإعدادات

source: About
ar: عنا

source: Public Events
ar: المناسبات الهجرية

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Language
ar: اللغة

source: Dark Mode
ar: الوضع الليلي

# font
source: Font Type
ar: نوع الخط

source: Undo
ar: تراجع

# saved
source: Event Saved
ar: تم الحفظ

# deleted
source: Event Deleted
ar: تم الحذف

# notificationOn
source: You will notified for
ar: سوف تتلقى إشعار عن

# notificationOff
source: Notification cancelled
ar: لن تتلقى إشعار

source: title
ar: عنوان الحدث

# titleHint
source: please enter a title
ar: أدخل عنوانا للحدث

source: pick Date
ar: اختر التاريخ

# hijriDateHint
source: Hijri Date will go here
ar: سيتم عرض التاريخ الهجري هنا

# noEvents
source: No Events Yet!
ar: لا توجد أحداث محفوظة!

# navBack
source: Navigate back to see it
ar: يمكنك العودة للخلف لرؤية ما حفظت
